{
    "header": {
      "logo": "LOGO",
      "welcome": "Добредојде: ",
      "home": "Дома",
      "reservations": "Направете резервација",
      "login": "Логирај се",
      "logout": "Одјави се"
    },
    "footer": {
      "languageEn": "English",
      "languageMk": "Македонски"
    },
    "mainContent": {
      "title": "MIHAJLOV AUTO REPAIR",
      "description": "Нудиме брзи и прифатливи услуги за вашите автомобили посетете не и уверете се.",
      "button": "Научи повеке"
    },
    "aboutUs":{
      "title": "За нас",
      "firstParagraph": "Лоцирани во Струмица, MIHAJLOV AUTO REPAIR е BMW специјалист од 2020 година. Основан од Kristijan Mihajlov, нашиот тим има повеке од 10 години искуство, и нудиме услуги за сите типови на BMW возила.",
      "secondParagraph": "Нашите вработени зе BMW експерти, нудиме разновидни сервиси и гаранции за иститие. Користиме најнови софтвери за дијагностика и оригинални BMW делови, се со цел вашето возило да го добие она што го заслужува.",
      "thirdParagraph": "Ние сме доста флексиблини, и се трудиме секогаш и двете страни да бидат задоволни. Во MIHAJLOV AUTo REPAIR, вашето BMW е во рацете на професионалци кои се грижат за него."
    },
    "ourServices":{
      "title": "Нашите услуги",
      "firstCardTitle": "РУТИНСКО ОДРЖУВАЊЕ",
      "firstCardDescription": "Одржувајте го вашето BMW во врвна состојба со нашите сеопфатни пакети за одржување.",
      "secondCardTitle": "ДИЈАГНОСТИКА И ПОПРАВКИ",
      "secondCardDescription": "Од мали проблеми до поголеми поправки, имаме експертиза да дијагностицираме и да го поправиме секој проблем.",
      "thirdCardTitle": "ПОСТАПУВАЊЕ НА ПЕРФОРМАНСИ",
      "thirdCardDescription": "Ослободете го целосниот потенцијал на вашето BMW со нашите специјализирани услуги за подесување на перформанси.",
      "fourthCardTitle": "ПРЕДКУПНИ ИНСПЕКЦИИ",
      "fourthCardDescription": "Обезбедете душевен мир пред да купите користено BMW со нашите услуги за детална инспекција."
    },
    "whyChooseUs": {
      "title": "ЗОШТО ДА НЕ ИЗБЕРЕТЕ НАС",
      "bmwExpertise": {
        "title": "Експертиза на BMW",
        "description": "Нашите техничари не се само општи механичари, тие се високо обучени специјалисти на BMW со долгогодишно практично искуство. Имаме фабрички сертифицирана обука која ни овозможува да ги разбереме сложеноста на секој модел на BMW, од класичната серија до најновите изданија со високи перформанси Нашата посветеност е да обезбедиме ниво на услуга што ги задоволува високите стандарди на BMW, осигурувајќи се дека секоја задача за поправка и одржување се изведува со прецизност, перформансите и долговечноста на вашето возило се наш главен приоритет"
      },
      "stateOfTheArtEquipment": {
        "title": "Современа опрема",
        "description": "Ние се гордееме што ги користиме само најновите и најнапредните алатки и технологија достапни во автомобилската индустрија. Нашата работилница е опремена со најсовремена дијагностичка опрема која може брзо да ги идентификува проблемите кои можеби не се веднаш видливи Без разлика дали станува збор за напредна компјутерска дијагностика, висококвалитетни делови или специјализирани алатки дизајнирани специјално за BMW, ние го користиме најдоброто од најдобрите за да обезбедиме непречено функционирање на вашиот автомобил."
      },
      "personalizedService": {
        "title": "Персонализирана услуга",
        "description": "Во нашата работилница, секој сопственик на BMW се третира како дел од семејството. Разбираме дека секој клиент има уникатни потреби и преференции кога станува збор за неговото возило, и ние одиме повеќе за да ги приспособиме нашите услуги за да ги исполниме тие Од моментот кога ќе поминете низ нашите врати, нашите техничари одвојуваат време за да ги разберат вашите навики за возење, како и какви било грижи што може да ги имате за вашиот автомобил јасна комуникација во текот на целиот процес, осигурувајќи дека сте информирани и удобно со сите препораки и одлуки за услугите"
      },
      "transparentPricing": {
        "title": "Транспарентни цени",
        "description": "Ние веруваме во обезбедувањето на нашите клиенти целосна транспарентност кога станува збор за цените. Кај нас нема скриени надоместоци, изненадувачки трошоци или двосмислени објаснувања. Пред да се изврши каква било работа на вашето BMW, даваме детална проценка од вклучените трошоци, за да знаете за што точно плаќате Нашата посветеност на чесните цени ни овозможува да изградиме долготрајни односи засновани на доверба и сигурност дека вредноста што ја добивате е усогласена со висококвалитетната услуга што ја заслужувате Со транспарентни цени, вашата инвестиција во вашиот автомобил е секогаш јасна"
      }
    },
    "makeReservation": {
      "title": "Резервирајте денес!",
      "description": "Ајде да ги отелотвориме вашите убави идеи заедно, да го поедноставиме начинот на кој ги визуелизирате вашите следни големи работи.",
      "button": "Kонтактирајте со нас"
    },
    "reservation": {
      "title": "Резервација",
      "name": "Kорисничко име",
      "phoneNumber": "Телефон",
      "model": "Модел",
      "type": "Тип",
      "description": "Краток опис",
      "dateTime": "Датум и време",
      "reserve": "Резервирај",
      "actions": "Акции",
      "search": "Барај",
      "users": "Корисници",
      "modelsAndTypes": "Модели & Типови",
      "reservations": "Резервации"
    },
    "users": {
      "title": "Корисници",
      "name": "Kорисничко име",
      "phoneNumber": "Телефон",
      "model": "Модел",
      "actions": "Акции"
    },
    "mAndT": {
      "models": "Модели",
      "types": "Типови",
      "name": "Име",
      "actions": "Акции"
    },
    "login": {
      "title": "Најави се",
      "username": "Корисничко име",
      "password": "Лозинка",
      "or": "или"
    },
    "register": {
      "title": "Регистрирај се",
      "username": "Корисничко име",
      "phoneNumber":" Телефон",
      "password": "Лозинка",
      "confirmPassword": "Потврди лозинка",
      "or": "или"
    },
    "messages": {
      "invalidEmail": "Невалиден е-маил!",
      "enterPassword": "Внесете лозинка!",
      "invalidCred": "Невалидно корисничко име или лозинка",
      "loginSuccessful": "Најавени сте!",
      "registerSuccessful": "Регистрацијата е успешна!",
      "passwordNotMatch": "Лозинките не се совпаѓаат!",
      "loginAgain": "Ве молам најавете се повторно",
      "tryAgain": "ве молам пробајте повторно",
      "missingModelsAndTypes": "Модел и тип мора да се селектира",
      "reservationCreated": "Резервацијата беше успешно направена!",
      "reservationCreateFail": "Неуспеавме да направиме резервација.",
      "invalidDate": "Невалиден датум",
      "errorHappedn": "Настана грешка",
      "errorSavingData": "Грешка во зачување на податоците",
      "errorUpdatingData": "Грешка во ажурирање на податоците",
      "errorDeletingData": "Грешка во бришење на податоците",
      "errorAddingData": "Грешка во додавање на податоците",
      "errorGettingData": "Грешка при добивање податоци",
      "errorChangingRole": "Грешка при промена на улога",
      "updatingSuccessful": "Aжурирањето беше успешно",
      "addingSuccessful": "Додавањето на елемент е успешно",
      "deletingSuccessful": "Бришењето е успешно"
    },
    "dialog": {
      "confirm": "Потврди",
      "cancel": "Откажи",
      "yes": "Да",
      "no": "Не",
      "roleTitle": "Промени привилегија на корисник",
      "roleRemoveAdminDescription": "Далисте сигурни дека сакате да му ја одземете Админ привилегијата на корисникот",
      "roleAddAdminDescription": "Дали сте сигурни дека сакате да има Админ привилегија корисникот",
      "deleteTitle": "Избриши?",
      "deleteUserDescription": "Избриши корисник со име",
      "deleteReservationDescription": "Избриши резервација"
    }
  }
  